dummynet.org
#+TITLE: Dummynet Usage on Mac
#+LINK: PfOnMacOSX https://pleiades.ucsc.edu/hyades/PF_on_Mac_OS_X
#+LINK: DummynetRevisited http://info.iet.unipi.it/~luigi/papers/20091201-dummynet.pdf
#+LINK: epoll example https://banu.com/blog/2/how-to-use-epoll-a-complete-example-in-c

Here some =dummynet= usages on Mac

* Configure Bandwidth

  1. Create pipe with bandwidth, redirect packets to the pipe
    #+BEGIN_SRC sh
      sudo dnctl pipe 1 config bw 1Kbit/s
      echo "dummynet out proto tcp from any to wordpress.org pipe 1" |sudo pfctl -f -
    #+END_SRC
  2. Enable if not
     #+BEGIN_EXAMPLE
       sudo pfctl -e
     #+END_EXAMPLE
  4. do download and watch the speed
    #+BEGIN_SRC sh
      wget -O /dev/null wordpress.org/latest.zip #=>
      ... 3.02KB/s ...
    #+END_SRC
  5. Adjust the bandwitch on fly and watch the speed
     #+BEGIN_SRC sh
       sudo dnctl pipe 1 config bw 10Kbit/s #=>
       ... 61.0KB/s ...
     #+END_SRC
  6. Reset and disable
     #+BEGIN_EXAMPLE
     sudo pfctl -f /etc/pf.conf
     sudo pfctl -d
     #+END_EXAMPLE

