dummynet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-27 Fri 17:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dummynet Usage on Mac</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nan Jun Jie" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a> | 
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Dummynet Usage on Mac</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2db635d">Configure Bandwidth</a></li>
</ul>
</div>
</div>
<p>
Here some <code>dummynet</code> usages on Mac
</p>

<div id="outline-container-org2db635d" class="outline-2">
<h2 id="org2db635d">Configure Bandwidth</h2>
<div class="outline-text-2" id="text-org2db635d">
<ol class="org-ol">
<li><p>
Create pipe with bandwidth, redirect packets to the pipe
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo dnctl pipe 1 config bw 1Kbit/s
<span style="color: #b0c4de;">echo</span> <span style="color: #bdb76b;">"dummynet out proto tcp from any to wordpress.org pipe 1"</span> |sudo pfctl -f -
</pre>
</div></li>
<li><p>
Enable if not
</p>
<pre class="example">
sudo pfctl -e
</pre></li>
<li><p>
do download and watch the speed
</p>
<div class="org-src-container">
<pre class="src src-sh">wget -O /dev/null wordpress.org/latest.zip <span style="color: #00cd66;">#</span><span style="color: #00cd66;">=&gt;</span>
... 3.02KB/s ...
</pre>
</div></li>
<li><p>
Adjust the bandwitch on fly and watch the speed
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo dnctl pipe 1 config bw 10Kbit/s <span style="color: #00cd66;">#</span><span style="color: #00cd66;">=&gt;</span>
... 61.0KB/s ...
</pre>
</div></li>
<li><p>
Reset and disable
</p>
<pre class="example">
sudo pfctl -f /etc/pf.conf
sudo pfctl -d
</pre></li>
</ol>
</div>
</div>
</div>
</body>
</html>
